const config = require('../config');

module.exports = {
  command: "menu",
  description: "To get the menu.",
  react: "🚀",
  category: "main",
  execute: async (socket, msg, args, number) => {
    try {
      const from = msg.key.remoteJid;
      const sender = msg.key.participant || from;
      const pushname = msg.pushName || "there";

      // New style queen imalsha md 
      const menumsg = `
*╭━━━〔𝐐𝐔𝐄𝐄𝐍 𝐈𝐌𝐋𝐀𝐒𝐇𝐀 𝐌𝐄𝐍𝐔〕━━━┈⊷*
*┃◆╭──────────────────*
*┃◆│ 👥𝚄𝚂𝙴𝚁 :❯ ${pushname}*
*┃◆│ 🔴𝙼𝙾𝙳𝙴 :❯ 𝙿𝚄𝙱𝙻𝙸𝙲*
*┃◆│ 🚀𝙿𝚁𝙴𝙵𝙸𝚇 :❯ ${config.PREFIX}*
*┃◆│ ⏳𝚅𝙴𝚁𝚂𝙸𝙾𝙽 :❯ 1.0.0*
*┃◆╰──────────────────*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃〕━━┈⊷*
*┃◆│ •🎧 𝚂𝙾𝙽𝙶*
*┃◆│ •🎥 𝚅𝙸𝙳𝙴𝙾*
*┃◆│ •📳 𝚃𝙸𝙺𝚃𝙾𝙺*
*┃◆│ •🪀 𝙵𝙱*
*┃◆│ •🗣️ 𝙰𝙿𝙺*
*┃◆│ •📸 𝙸𝙼𝙶*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐒𝐄𝐀𝐑𝐂𝐇〕━━┈⊷*
*┃◆│ •🔍 𝚈𝚃𝚂*
*┃◆│ •♻️ 𝙻𝚈𝚁𝙸𝙲𝚂*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐌𝐀𝐈𝐍〕━━┈⊷*
*┃◆│ •👋 𝙰𝙻𝙸𝚅𝙴*
*┃◆│ •📍 𝙿𝙸𝙽𝙶*
*┃◆│ •🔴 𝚄𝙿𝚃𝙸𝙼𝙴*
*┃◆│ •⚙️ 𝚂𝚈𝚂𝚃𝙴𝙼*
*┃◆│ •🔗 𝙷𝙴𝙻𝙿*
*┃◆│ •⚖️ 𝙾𝚆𝙽𝙴𝚁*
*┃◆│ •🆔 𝙹𝙸𝙳*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐗𝐓𝐑𝐀〕━━┈⊷*
*┃◆│ •🔄 𝚅𝚅*
*┃◆│ •🚫 𝙳𝙴𝙻𝙴𝚃𝙴*
*┃◆│ •📵 𝚇𝚅𝙸𝙳𝙴𝙾*
*┃◆│ •🔞 𝚇𝙽𝚇𝚇*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐆𝐑𝐎𝐔𝐏〕━━┈⊷*
*┃◆│ •👥 𝙷𝙸𝙳𝙴𝚃𝙰𝙶*
*┃◆│ •🗑️ 𝙳𝙴𝙻𝙴𝚃𝙴*
*┃◆│ •🔭 𝙼𝚄𝚃𝙴*
*┃◆│ •📡 𝚄𝙽𝙼𝚄𝚃𝙴*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐀𝐈〕━━┈⊷*
*┃◆│ •📝 𝙰𝙸*
*┃◆│ •📑 𝙶𝙿𝚃*
*┃◆│ •🪙 𝙵𝙻𝚄𝚇𝟸*
*┃◆│ •📩 𝙶𝙴𝙼𝙸𝙽𝙸*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐂𝐎𝐍𝐕𝐄𝐑𝐓〕━━┈⊷*
*┃◆│ •🧮 𝚃𝚃𝚂*
*┃◆│ •📚 𝚃𝙴𝚇𝚃𝙼𝙰𝙺𝙴𝚁*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐔𝐒𝐄𝐑〕━━┈⊷*
*┃◆│ •🚫 𝙱𝙻𝙾𝙲𝙺*
*┃◆│ •☢️ 𝚄𝙽𝙱𝙻𝙾𝙲𝙺*
*┃◆│ •⛔ 𝙰𝚄𝚃𝙾𝙱𝙸𝙾*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐍𝐄𝐖 𝐂𝐎𝐌𝐌𝐀𝐍𝐃𝐒〕━━┈⊷*
*┃◆│ •🛑 𝙵𝙻𝚄𝚇𝟸*
*┃◆│ •🌡️ 𝙰𝙿𝙺𝟸*
*┃◆│ •⚫ 𝙿𝙻𝙰𝚈*
*┃◆│ •🎧 𝙼𝙿𝟺*
*┃◆│ •⚖️ 𝙶𝙿𝚃*
*┃◆│ •📩 𝙶𝙴𝙼𝙸𝙽𝙸*
*┃◆│ •📚 𝚃𝙴𝚇𝚃𝙼𝙰𝙺𝙴𝚁*
*┃◆│ •🖊️ 𝙽𝙴𝚆*
*╰━━━━━━━━━━━━━━━┈⊷*

*╭━━〔𝐍𝐄𝐖 𝐅𝐄𝐀𝐓𝐔𝐑𝐄𝐒〕━━┈⊷*
*┃◆│ •🌡️ 𝚆𝙴𝙰𝚃𝙷𝙴𝚁*
*┃◆│ •🔍 𝚀𝚄𝙾𝚃𝙴*
*┃◆│ •👻 𝙹𝙾𝙺𝙴*
*┃◆│ •🪙 𝙲𝚁𝚈𝙿𝚃𝙾*
*┃◆│ •📝 𝙽𝙴𝚆𝚂*
*┃◆│ •🚫 𝙵𝙰𝙲𝚃*
*┃◆│ •🗝️ 𝙰𝙳𝚅𝙸𝙲𝙴*
*╰━━━━━━━━━━━━━━━┈⊷*

*𝙿𝙾𝚆𝙴𝚁𝙴𝙳 𝙱𝚈 𝐐𝐔𝐄𝐄𝐍 𝐈𝐌𝐀𝐋𝐒𝐇𝐀 𝐌𝐃*
`;

      // Send menu with image and styled contextInfo
      await socket.sendMessage(sender, {
        image: { url: 'https://files.catbox.moe/letvwf.jpg' },
        caption: menumsg,
        contextInfo: {
          mentionedJid: [sender],
          forwardingScore: 999,
          isForwarded: true,
          forwardedNewsletterMessageInfo: {
            newsletterJid: '120363282833839832@newsletter',
            newsletterName: '𝐐𝐔𝐄𝐄𝐍 𝐈𝐌𝐀𝐋𝐒𝐇𝐀 𝐌𝐃 𝐓𝐄𝐂𝐇',
            serverMessageId: 143
          }
        }
      }, { quoted: msg });

    } catch (e) {
      console.error(e);
      await socket.sendMessage(msg.key.remoteJid, { 
        text: `❌ 𝙴𝚁𝚁𝙾𝚁: ${e.message}` 
      }, { quoted: msg });
    }
  }
};
